
/* 

2020-02-04  
	-- закрытие кой каких косяков
	-- причесывание
	-- оптимизация (попытки)

2020-03-31 версия потуга выгрузки пачки патчей.
	++ создать и выгрузить пустые папки (1..10). 
	++ засунуть в папки данные и выгрузить
	++ в гламурной версии траблы с асихронным jszip, заменил синхронным.

2020-03-30 версия типа демо, 3 пака оконечников, но подключен только кабзон х 1.00
2020-01-29 версия совсем демо, оконечники альфа, минимальная переделка винрара микроконтроллера, но альфа оконечники.
*/